
&НаКлиенте
Процедура Отложить(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ОтложитьНаСервере(ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ОтложитьНаСервере(Знач НоменклатураСсылка)

	ПараметрыРегламентногоЗадания = _Регламенты.НовыеПараметрыРегламентногоЗадания();
	ПараметрыРегламентногоЗадания.Ключ = _Регламенты.КлючЗадания(НоменклатураСсылка);
	
	_РасписаниеРегламентногоЗадания = _Регламенты.НовоеРасписаниеРегламентногоЗадания(ВремяНачала, ВремяОкончания, 30);
	 
	УникальныйИдентификаторЗадания = Строка(_Регламенты.СгенерироватьОтложенноеЗадание(
		НоменклатураСсылка,
		ПараметрыРегламентногоЗадания,
		_РасписаниеРегламентногоЗадания));
	
КонецПроцедуры
