
// Процедура - Отложенное задание
//
// Параметры:
//  _Параметры	 - Структура - 
//
Процедура ОтложенноеЗадание( _Параметры = Неопределено ) Экспорт
	
	Если _Параметры = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Попытка
		
		НоменклатураОбъект = _Параметры["Ссылка"].ПолучитьОбъект();
		НоменклатураОбъект.Используется = Истина;
		НоменклатураОбъект.Записать();
		
	Исключение
		
		_ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации(
			Событие(),
			УровеньЖурналаРегистрации.Ошибка,
			_Параметры["Ссылка"].Метаданные(),
			_Параметры["Ссылка"], _ТекстОшибки);
			
		ВызватьИсключение _ТекстОшибки;	
		
	КонецПопытки;  
	
	УдалитьРегламентноеЗадание( _Параметры["Ссылка"] );
	
КонецПроцедуры

Процедура УдалитьРегламентноеЗадание(Знач Ссылка)
	
	Отбор = НовыйОтборРегламентногоЗадания(КлючЗадания(Ссылка));
	НайденныеРегламентныеЗадания  = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);	
	
	Если НайденныеРегламентныеЗадания.Количество() Тогда
		
		Для каждого ЭлементКоллекции Из НайденныеРегламентныеЗадания Цикл
			
			ЭлементКоллекции.Удалить();
			
		КонецЦикла; 
		
	КонецЕсли;
	
	
КонецПроцедуры


// Функция - Сгенерировать отложенное задание
//
// Параметры:
//  НоменклатураСсылка	 - СправочникСсылка.Номенклатура - 
//  ПараметрыРегламентногоЗадания	 - Структура  - см.НовыеПараметрыРегламентногоЗадания() 
// 
// Возвращаемое значение:
//   - 
//
Функция СгенерироватьОтложенноеЗадание(Знач НоменклатураСсылка, ПараметрыРегламентногоЗадания, РасписаниеРегламентногоЗадания) Экспорт 
	
	_Параметры = Новый Массив;
	_Параметры.Добавить( НоменклатураСсылка );
	
	регламентноеЗаданиеСценария 			= РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.ОтложенноеЗадание);
	регламентноеЗаданиеСценария.Использование 	= ПараметрыРегламентногоЗадания.Использование;
	регламентноеЗаданиеСценария.Наименование 	= ПараметрыРегламентногоЗадания.Наименование;
	регламентноеЗаданиеСценария.Ключ			= ПараметрыРегламентногоЗадания.Ключ; 
	
	регламентноеЗаданиеСценария.Параметры 		= _Параметры; // в качестве параметра ссылка на номенклатуру
	регламентноеЗаданиеСценария.Расписание 					= РасписаниеРегламентногоЗадания; 	
	регламентноеЗаданиеСценария.Записать();	
	
	Возврат регламентноеЗаданиеСценария.УникальныйИдентификатор; 
	
КонецФункции

Функция НовыйОтборРегламентногоЗадания(КлючПоиска)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ключ", КлючПоиска);
	Отбор.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ОтложенноеЗадание);
	Отбор.Вставить("Предопределенное", Ложь);
	Отбор.Вставить("Использование", Истина);
	Отбор.Вставить("Наименование", "Отложенное выполнение");

	Возврат Отбор;
	
КонецФункции

Функция КлючЗадания(Знач НоменклатураСсылка) Экспорт 
	Возврат СтрШаблон("Отложенная запись <%1>", НоменклатураСсылка);	
КонецФункции

// Конструктор структуры, новых параметров регламентного задания
// 
// Возвращаемое значение:
//   - 
//
Функция НовыеПараметрыРегламентногоЗадания() Экспорт 
	
	ПараметрыРегламентногоЗадания = Новый Структура;
	ПараметрыРегламентногоЗадания.Вставить("Использование", Истина);
	ПараметрыРегламентногоЗадания.Вставить("Наименование", "Отложенное выполнение");
	ПараметрыРегламентногоЗадания.Вставить("Ключ", "");

	Возврат ПараметрыРегламентногоЗадания;
	
КонецФункции

Функция НовоеРасписаниеРегламентногоЗадания(ВремяНачала, ВремяКонца = Неопределено, ПериодПовтораВТечениеДня = 60) Экспорт 
	
	РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
	РасписаниеРегламентногоЗадания.ПериодПовтораДней = 1;  // один раз в день
	РасписаниеРегламентногоЗадания.ВремяНачала = ВремяНачала;
	//РасписаниеРегламентногоЗадания.ВремяКонца = ВремяКонца; // задание без времени окончания, пока не выполнится
	РасписаниеРегламентногоЗадания.ПериодПовтораВТечениеДня = ПериодПовтораВТечениеДня; //Период времени в секундах, через который нужно запускать задание в течение дня.  

	Возврат РасписаниеРегламентногоЗадания;
	
КонецФункции

Функция СтруктураПараметровОтложенногоЗадания() Экспорт 
	
	_Параметры = Новый Структура;
	_Параметры.Вставить("Идентификатор", Неопределено);
	_Параметры.Вставить("Ссылка", Неопределено); // СправочникСсылка.Номенклатура
	
	Возврат _Параметры;
	
КонецФункции

Функция Событие()
	
	Возврат "ОтложенноеЗадание";
	
КонецФункции

Процедура ПередЗаписьюСправочникаПередЗаписью(Источник, Отказ) Экспорт
	
	Попытка
		
		ВызватьИсключение "получение стека вызова";
		
	Исключение
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		ЗаписатьXML(ЗаписьXML, Источник);
		
		ЗаписьЖурналаРегистрации("РантаймЛог." + Источник.Метаданные().Имя,
			УровеньЖурналаРегистрации.Информация, Источник.Метаданные(), Источник,

			Символы.ПС + Символы.ПС + 

			ЗаписьXML.Закрыть() + Символы.ПС + Символы.ПС + 

			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
КонецПроцедуры
